SRI/sri_1/app/controllers/users_controller.rb

  def index
    @users = User.search(params[:term]).to_json
---
SELECT "users".* FROM "users" ORDER BY "users"."updated_at" DESC
SELECT MAX("users"."updated_at") FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("login", "password", "phone_number", "birth_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["login", "dev"], ["password", "dev123"], ["phone_number", "123456789"], ["birth_date", "12.02.1999"], ["created_at", "2018-03-26 19:08:29.786395"], ["updated_at", "2018-03-26 19:08:29.786395"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "login" = ? WHERE "users"."id" = ?  [["updated_at", "2018-03-26 19:22:00.155244"], ["login", "1dev"], ["id", 1]]

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."updated_at" DESC  [["id", 1]]
SELECT MAX("users"."updated_at") FROM "users" WHERE "users"."id" = ?  [["id", 1]]